package io8; //20231124

/*
 * 주요 기능
 *  1. 주문하기
 *         구매금액만큼 자동으로 로또번호를 발행한다.
 *         화면에서는
 *            구매금액을 입력받는다(1000원단위)
 *            서비스에 구매금액을 전달하고, 주문객체를 반환받는다.
 *         화면에
 *            회차번호 - 20231124
 *            주문번호 - 유닉스타임
 *            구매한 로또번호를 출력한다.
 *            
 *         서비스에서는
 *            주문번호를 새로 생성한다.
 *            구매금액만큼 로또번호를 생성한다.
 *            주문객체를 생성해서 회차번호, 주문번호, 생성된 로또번호를 저장한다.
 *            주문객체를 Repository에 전달해서 저장시킨다.
 *            주문객체를 반환한다.
 *         
 *  2. 번호추첨하기
 *  3. 
 */

public class MyCaption { }
